Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ2064DAR176.PIC
      <edc:SFRDef edc:_addr="0x1F8602B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnn-------nnnn-" edc:cname="CNFC" edc:desc="" edc:impl="0xf01e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000-------0000-" edc:name="CNFC" edc:nzwidth="32" edc:por="----------------0000-------0000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFC1" edc:mask="0x1" edc:name="CNFC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC2" edc:mask="0x1" edc:name="CNFC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC3" edc:mask="0x1" edc:name="CNFC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC4" edc:mask="0x1" edc:name="CNFC4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFC12" edc:mask="0x1" edc:name="CNFC12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC13" edc:mask="0x1" edc:name="CNFC13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC14" edc:mask="0x1" edc:name="CNFC14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFC15" edc:mask="0x1" edc:name="CNFC15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8602C0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnn-------nnnn-" edc:cname="SRCON0C" edc:desc="" edc:impl="0xf01e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000-------0000-" edc:name="SRCON0C" edc:nzwidth="32" edc:por="----------------0000-------0000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0C1" edc:mask="0x1" edc:name="SR0C1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0C2" edc:mask="0x1" edc:name="SR0C2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0C3" edc:mask="0x1" edc:name="SR0C3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0C4" edc:mask="0x1" edc:name="SR0C4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR0C12" edc:mask="0x1" edc:name="SR0C12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0C13" edc:mask="0x1" edc:name="SR0C13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0C14" edc:mask="0x1" edc:name="SR0C14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR0C15" edc:mask="0x1" edc:name="SR0C15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8602D0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="3" edc:access="----------------nnnn-------nnnn-" edc:cname="SRCON1C" edc:desc="" edc:impl="0xf01e" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000-------0000-" edc:name="SRCON1C" edc:nzwidth="32" edc:por="----------------0000-------0000-" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1C1" edc:mask="0x1" edc:name="SR1C1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1C2" edc:mask="0x1" edc:name="SR1C2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1C3" edc:mask="0x1" edc:name="SR1C3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1C4" edc:mask="0x1" edc:name="SR1C4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SR1C12" edc:mask="0x1" edc:name="SR1C12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1C13" edc:mask="0x1" edc:name="SR1C13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1C14" edc:mask="0x1" edc:name="SR1C14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1C15" edc:mask="0x1" edc:name="SR1C15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8602E0" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x1F860300" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nn--------------" edc:cname="ANSELD" edc:desc="" edc:grp="PORTD" edc:impl="0xffffc000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------11--------------" edc:name="ANSELD" edc:nzwidth="0x20" edc:por="----------------11--------------" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSD14" edc:desc="" edc:mask="0x1" edc:name="ANSD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSD15" edc:desc="" edc:mask="0x1" edc:name="ANSD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860310" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn-nnnnnnnn" edc:cname="TRISD" edc:desc="" edc:grp="PORTD" edc:impl="0xfffffeff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1111111-11111111" edc:name="TRISD" edc:nzwidth="0x20" edc:por="----------------1111111-11111111" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISD0" edc:desc="" edc:mask="0x1" edc:name="TRISD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD1" edc:desc="" edc:mask="0x1" edc:name="TRISD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD2" edc:desc="" edc:mask="0x1" edc:name="TRISD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD3" edc:desc="" edc:mask="0x1" edc:name="TRISD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD4" edc:desc="" edc:mask="0x1" edc:name="TRISD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD5" edc:desc="" edc:mask="0x1" edc:name="TRISD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD6" edc:desc="" edc:mask="0x1" edc:name="TRISD6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD7" edc:desc="" edc:mask="0x1" edc:name="TRISD7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISD9" edc:desc="" edc:mask="0x1" edc:name="TRISD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD10" edc:desc="" edc:mask="0x1" edc:name="TRISD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD11" edc:desc="" edc:mask="0x1" edc:name="TRISD11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISD12" edc:desc="" edc:mask="0x1" edc:name="TRISD12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISD13" edc:desc="" edc:mask="0x1" edc:name="TRISD13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISD14" edc:desc="" edc:mask="0x1" edc:name="TRISD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISD15" edc:desc="" edc:mask="0x1" edc:name="TRISD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860320" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn-nnnnnnnn" edc:cname="PORTD" edc:desc="" edc:grp="PORTD" edc:impl="0xfffffeff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxx-xxxxxxxx" edc:name="PORTD" edc:nzwidth="0x20" edc:por="----------------xxxxxxx-xxxxxxxx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RD0" edc:desc="" edc:mask="0x1" edc:name="RD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD1" edc:desc="" edc:mask="0x1" edc:name="RD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD2" edc:desc="" edc:mask="0x1" edc:name="RD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD3" edc:desc="" edc:mask="0x1" edc:name="RD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD4" edc:desc="" edc:mask="0x1" edc:name="RD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD5" edc:desc="" edc:mask="0x1" edc:name="RD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD6" edc:desc="" edc:mask="0x1" edc:name="RD6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD7" edc:desc="" edc:mask="0x1" edc:name="RD7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RD9" edc:desc="" edc:mask="0x1" edc:name="RD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD10" edc:desc="" edc:mask="0x1" edc:name="RD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD11" edc:desc="" edc:mask="0x1" edc:name="RD11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RD12" edc:desc="" edc:mask="0x1" edc:name="RD12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RD13" edc:desc="" edc:mask="0x1" edc:name="RD13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RD14" edc:desc="" edc:mask="0x1" edc:name="RD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RD15" edc:desc="" edc:mask="0x1" edc:name="RD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860330" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn-nnnnnnnn" edc:cname="LATD" edc:desc="" edc:grp="PORTD" edc:impl="0xfffffeff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxx-xxxxxxxx" edc:name="LATD" edc:nzwidth="0x20" edc:por="----------------xxxxxxx-xxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="LATD0" edc:desc="" edc:mask="0x1" edc:name="LATD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD1" edc:desc="" edc:mask="0x1" edc:name="LATD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD2" edc:desc="" edc:mask="0x1" edc:name="LATD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD3" edc:desc="" edc:mask="0x1" edc:name="LATD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD4" edc:desc="" edc:mask="0x1" edc:name="LATD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD5" edc:desc="" edc:mask="0x1" edc:name="LATD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD6" edc:desc="" edc:mask="0x1" edc:name="LATD6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD7" edc:desc="" edc:mask="0x1" edc:name="LATD7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LATD9" edc:desc="" edc:mask="0x1" edc:name="LATD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD10" edc:desc="" edc:mask="0x1" edc:name="LATD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD11" edc:desc="" edc:mask="0x1" edc:name="LATD11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATD12" edc:desc="" edc:mask="0x1" edc:name="LATD12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATD13" edc:desc="" edc:mask="0x1" edc:name="LATD13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="LATD14" edc:desc="" edc:mask="0x1" edc:name="LATD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LATD15" edc:desc="" edc:mask="0x1" edc:name="LATD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860340" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="4" edc:access="----------------nnnnnnn-nnnnnnnn" edc:cname="ODCD" edc:desc="" edc:grp="PORTD" edc:impl="0xfffffeff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000-00000000" edc:name="ODCD" edc:nzwidth="0x20" edc:por="----------------0000000-00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCD0" edc:desc="" edc:mask="0x1" edc:name="ODCD0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD1" edc:desc="" edc:mask="0x1" edc:name="ODCD1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD2" edc:desc="" edc:mask="0x1" edc:name="ODCD2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD3" edc:desc="" edc:mask="0x1" edc:name="ODCD3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD4" edc:desc="" edc:mask="0x1" edc:name="ODCD4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD5" edc:desc="" edc:mask="0x1" edc:name="ODCD5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD6" edc:desc="" edc:mask="0x1" edc:name="ODCD6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD7" edc:desc="" edc:mask="0x1" edc:name="ODCD7" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCD9" edc:desc="" edc:mask="0x1" edc:name="ODCD9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD10" edc:desc="" edc:mask="0x1" edc:name="ODCD10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD11" edc:desc="" edc:mask="0x1" edc:name="ODCD11" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCD12" edc:desc="" edc:mask="0x1" edc:name="ODCD12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCD13" edc:desc="" edc:mask="0x1" edc:name="ODCD13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCD14" edc:desc="" edc:mask="0x1" edc:name="ODCD14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCD15" edc:desc="" edc:mask="0x1" edc:name="ODCD15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
