Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ2064DAR176.PIC
      <edc:MuxedSFRDef edc:_addr="0x1F8E3018" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:nzwidth="32" ltx:memberofperipheral="USB">
        <edc:SelectSFR edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:when="($0xc &amp; 0xf0000) == 0x0">
          <edc:SFRDef edc:_addr="0x1F8E3018" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:access="----nnnnnn---------------rrrrrrr" edc:cname="USBIE0CSR2" edc:desc="" edc:impl="0xfc0007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----000000---------------0000000" edc:name="USBIE0CSR2" edc:nzwidth="32" edc:por="----000000---------------0000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RXCNT" edc:desc="" edc:mask="0x7f" edc:name="RXCNT" edc:nzwidth="7"/>
                <edc:AdjustPoint edc:offset="15"/>
                <edc:SFRFieldDef edc:cname="SPEED" edc:desc="" edc:mask="0x3" edc:name="SPEED" edc:nzwidth="2"/>
                <edc:SFRFieldDef edc:cname="NAKLIM" edc:desc="" edc:mask="0xf" edc:name="NAKLIM" edc:nzwidth="4"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:SelectSFR>
        <edc:SelectSFR edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1">
          <edc:SFRDef edc:_addr="0x1F8E3018" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnn--rrrrrrrrrrrrrr" edc:cname="USBIENCSR2" edc:desc="" edc:impl="0xffff3fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000--00000000000000" edc:name="USBIENCSR2" edc:nmmrid="1900" edc:nzwidth="32" edc:por="0000000000000000--00000000000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RXCNT" edc:desc="" edc:mask="0x3fff" edc:name="RXCNT" edc:nzwidth="14"/>
                <edc:AdjustPoint edc:offset="2"/>
                <edc:SFRFieldDef edc:cname="TEP" edc:desc="" edc:mask="0xf" edc:name="TEP" edc:nzwidth="4"/>
                <edc:SFRFieldDef edc:cname="PROTOCOL" edc:desc="" edc:mask="0x3" edc:name="PROTOCOL" edc:nzwidth="2"/>
                <edc:SFRFieldDef edc:cname="SPEED" edc:desc="" edc:mask="0x3" edc:name="SPEED" edc:nzwidth="2"/>
                <edc:SFRFieldDef edc:cname="TXINTERV" edc:desc="" edc:mask="0xff" edc:name="TXINTERV" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:SelectSFR>
      </edc:MuxedSFRDef>
      <edc:MuxedSFRDef edc:_addr="0x1F8E301C" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:nzwidth="32" ltx:memberofperipheral="USB">
        <edc:SelectSFR edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:when="($0xc &amp; 0xf0000) == 0x0">
          <edc:SFRDef edc:_addr="0x1F8E301C" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:access="rrrrrrrr------------------------" edc:cname="USBIE0CSR3" edc:desc="" edc:impl="0xff000000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xx0xxx10------------------------" edc:name="USBIE0CSR3" edc:nzwidth="32" edc:por="xx0xxx10------------------------">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:AdjustPoint edc:offset="24"/>
                <edc:SFRFieldDef edc:cname="UTMIDWID" edc:desc="" edc:mask="0x1" edc:name="UTMIDWID" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="SOFTCONE" edc:desc="" edc:mask="0x1" edc:name="SOFTCONE" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="DYNFIFOS" edc:desc="" edc:mask="0x1" edc:name="DYNFIFOS" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="HBTXEN" edc:desc="" edc:mask="0x1" edc:name="HBTXEN" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="HBRXEN" edc:desc="" edc:mask="0x1" edc:name="HBRXEN" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="BIGEND" edc:desc="" edc:mask="0x1" edc:name="BIGEND" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="MPTXEN" edc:desc="" edc:mask="0x1" edc:name="MPTXEN" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="MPRXEN" edc:desc="" edc:mask="0x1" edc:name="MPRXEN" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:SelectSFR>
        <edc:SelectSFR edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1">
          <edc:SFRDef edc:_addr="0x1F8E301C" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:access="rrrrrrrr--------nnnnnnnnnnnnnnnn" edc:cname="USBIENCSR3" edc:desc="" edc:impl="0xff00ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx--------0000000000000000" edc:name="USBIENCSR3" edc:nmmrid="1904" edc:nzwidth="32" edc:por="xxxxxxxx--------0000000000000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="TEP" edc:desc="" edc:mask="0xf" edc:name="TEP" edc:nzwidth="4"/>
                <edc:SFRFieldDef edc:cname="PROTOCOL" edc:desc="" edc:mask="0x3" edc:name="PROTOCOL" edc:nzwidth="2"/>
                <edc:SFRFieldDef edc:cname="SPEED" edc:desc="" edc:mask="0x3" edc:name="SPEED" edc:nzwidth="2"/>
                <edc:SFRFieldDef edc:cname="RXINTERV" edc:desc="" edc:mask="0xff" edc:name="RXINTERV" edc:nzwidth="8"/>
                <edc:AdjustPoint edc:offset="8"/>
                <edc:SFRFieldDef edc:cname="TXFIFOSZ" edc:desc="" edc:mask="0xf" edc:name="TXFIFOSZ" edc:nzwidth="4"/>
                <edc:SFRFieldDef edc:cname="RXFIFOSZ" edc:desc="" edc:mask="0xf" edc:name="RXFIFOSZ" edc:nzwidth="4"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:SelectSFR>
      </edc:MuxedSFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3020" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBFIFO0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBFIFO0" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3024" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBFIFO1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBFIFO1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3028" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBFIFO2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBFIFO2" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E302C" edc:_begin="0x0" edc:_end="0x40" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBFIFO3" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBFIFO3" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
