Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ2064DAR176.PIC
      <edc:SFRDef edc:_addr="0x1F8E30B4" edc:_begin="0x78" edc:_end="0xc0" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="4" edc:access="-nnnnnnnnnnnnnnn---------nnnnnnn" edc:cname="USBE6RXA" edc:desc="" edc:impl="0x7fff007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000000000000---------0000000" edc:name="USBE6RXA" edc:nzwidth="32" edc:por="-000000000000000---------0000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXFADDR" edc:desc="" edc:mask="0x7f" edc:name="RXFADDR" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:SFRFieldDef edc:cname="RXHUBADD" edc:desc="" edc:mask="0x7f" edc:name="RXHUBADD" edc:nzwidth="7"/>
            <edc:SFRFieldDef edc:cname="MULTTRAN" edc:desc="" edc:mask="0x1" edc:name="MULTTRAN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RXHUBPRT" edc:desc="" edc:mask="0x7f" edc:name="RXHUBPRT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E30B8" edc:_begin="0x78" edc:_end="0xc0" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="4" edc:access="-nnnnnnnnnnnnnnn---------nnnnnnn" edc:cname="USBE7TXA" edc:desc="" edc:impl="0x7fff007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000000000000---------0000000" edc:name="USBE7TXA" edc:nzwidth="32" edc:por="-000000000000000---------0000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXFADDR" edc:desc="" edc:mask="0x7f" edc:name="TXFADDR" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:SFRFieldDef edc:cname="TXHUBADD" edc:desc="" edc:mask="0x7f" edc:name="TXHUBADD" edc:nzwidth="7"/>
            <edc:SFRFieldDef edc:cname="MULTTRAN" edc:desc="" edc:mask="0x1" edc:name="MULTTRAN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TXHUBPRT" edc:desc="" edc:mask="0x7f" edc:name="TXHUBPRT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E30BC" edc:_begin="0x78" edc:_end="0xc0" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="4" edc:access="-nnnnnnnnnnnnnnn---------nnnnnnn" edc:cname="USBE7RXA" edc:desc="" edc:impl="0x7fff007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-000000000000000---------0000000" edc:name="USBE7RXA" edc:nzwidth="32" edc:por="-000000000000000---------0000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXFADDR" edc:desc="" edc:mask="0x7f" edc:name="RXFADDR" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="9"/>
            <edc:SFRFieldDef edc:cname="RXHUBADD" edc:desc="" edc:mask="0x7f" edc:name="RXHUBADD" edc:nzwidth="7"/>
            <edc:SFRFieldDef edc:cname="MULTTRAN" edc:desc="" edc:mask="0x1" edc:name="MULTTRAN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RXHUBPRT" edc:desc="" edc:mask="0x7f" edc:name="RXHUBPRT" edc:nzwidth="7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E30C0" edc:offset="64"/>
      <edc:SFRDef edc:_addr="0x1F8E3100" edc:_begin="0x100" edc:_end="0x104" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="5" edc:access="-----nnnnnnnnnnn-----nnnnnnnnnnn" edc:cname="USBE0CSR0" edc:desc="" edc:impl="0x7ff07ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000-----00000000000" edc:name="USBE0CSR0" edc:nzwidth="32" edc:por="-----00000000000-----00000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXMAXP" edc:desc="" edc:mask="0x7ff" edc:name="TXMAXP" edc:nzwidth="11"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="" edc:mask="0x1" edc:name="RXRDY" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="" edc:mask="0x1" edc:name="TXRDY" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="STALLED" edc:desc="" edc:mask="0x1" edc:name="STALLED" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SETUP" edc:desc="" edc:mask="0x1" edc:name="SETUP" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="" edc:mask="0x1" edc:name="ERROR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="REQPKT" edc:desc="" edc:mask="0x1" edc:name="REQPKT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="STATUS" edc:desc="" edc:mask="0x1" edc:name="STATUS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="NAKTO" edc:desc="" edc:mask="0x1" edc:name="NAKTO" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FLUSH" edc:desc="" edc:mask="0x1" edc:name="FLUSH" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DT" edc:desc="" edc:mask="0x1" edc:name="DT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DTWE" edc:desc="" edc:mask="0x1" edc:name="DTWE" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="19"/>
            <edc:SFRFieldDef edc:cname="DATAEND" edc:desc="" edc:mask="0x1" edc:name="DATAEND" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SETEND" edc:desc="" edc:mask="0x1" edc:name="SETEND" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="STALL" edc:desc="" edc:mask="0x1" edc:name="STALL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RXRDYC" edc:desc="" edc:mask="0x1" edc:name="RXRDYC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SETENDC" edc:desc="" edc:mask="0x1" edc:name="SETENDC" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E3104" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F8E3108" edc:_begin="0x108" edc:_end="0x180" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="6" edc:access="----nnnnnn---------------nnnnnnn" edc:cname="USBE0CSR2" edc:desc="" edc:impl="0xfc0007f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----000000---------------0000000" edc:name="USBE0CSR2" edc:nzwidth="32" edc:por="----000000---------------0000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXCNT" edc:desc="" edc:mask="0x7f" edc:name="RXCNT" edc:nzwidth="7"/>
            <edc:AdjustPoint edc:offset="15"/>
            <edc:SFRFieldDef edc:cname="SPEED" edc:desc="" edc:mask="0x3" edc:name="SPEED" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="NAKLIM" edc:desc="" edc:mask="0xf" edc:name="NAKLIM" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E310C" edc:_begin="0x108" edc:_end="0x180" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="6" edc:access="nnnnnnnn------------------------" edc:cname="USBE0CSR3" edc:desc="" edc:impl="0xff000000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000------------------------" edc:name="USBE0CSR3" edc:nzwidth="32" edc:por="00000000------------------------" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="24"/>
            <edc:SFRFieldDef edc:cname="UTMIDWID" edc:desc="" edc:mask="0x1" edc:name="UTMIDWID" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SOFTCONE" edc:desc="" edc:mask="0x1" edc:name="SOFTCONE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DYNFIFOS" edc:desc="" edc:mask="0x1" edc:name="DYNFIFOS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="HBTXEN" edc:desc="" edc:mask="0x1" edc:name="HBTXEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="HBRXEN" edc:desc="" edc:mask="0x1" edc:name="HBRXEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="BIGEND" edc:desc="" edc:mask="0x1" edc:name="BIGEND" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="MPTXEN" edc:desc="" edc:mask="0x1" edc:name="MPTXEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="MPRXEN" edc:desc="" edc:mask="0x1" edc:name="MPRXEN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3110" edc:_begin="0x108" edc:_end="0x180" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="6" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBE1CSR0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBE1CSR0" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TXMAXP" edc:desc="" edc:mask="0x7ff" edc:name="TXMAXP" edc:nzwidth="11"/>
            <edc:SFRFieldDef edc:cname="MULT" edc:desc="" edc:mask="0x1f" edc:name="MULT" edc:nzwidth="5"/>
            <edc:SFRFieldDef edc:cname="TXPKTRDY" edc:desc="" edc:mask="0x1" edc:name="TXPKTRDY" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FIFONE" edc:desc="" edc:mask="0x1" edc:name="FIFONE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="" edc:mask="0x1" edc:name="ERROR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FLUSH" edc:desc="" edc:mask="0x1" edc:name="FLUSH" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SETUPPKT" edc:desc="" edc:mask="0x1" edc:name="SETUPPKT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RXSTALL" edc:desc="" edc:mask="0x1" edc:name="RXSTALL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLRDT" edc:desc="" edc:mask="0x1" edc:name="CLRDT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="NAKTMOUT" edc:desc="" edc:mask="0x1" edc:name="NAKTMOUT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DATATGGL" edc:desc="" edc:mask="0x1" edc:name="DATATGGL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DTWREN" edc:desc="" edc:mask="0x1" edc:name="DTWREN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAREQMD" edc:desc="" edc:mask="0x1" edc:name="DMAREQMD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FRCDATTG" edc:desc="" edc:mask="0x1" edc:name="FRCDATTG" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAREQEN" edc:desc="" edc:mask="0x1" edc:name="DMAREQEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0x1" edc:name="MODE" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="AUTOSET" edc:desc="" edc:mask="0x1" edc:name="AUTOSET" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="18"/>
            <edc:SFRFieldDef edc:cname="UNDERRUN" edc:desc="" edc:mask="0x1" edc:name="UNDERRUN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SENDSTALL" edc:desc="" edc:mask="0x1" edc:name="SENDSTALL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SENTSTALL" edc:desc="" edc:mask="0x1" edc:name="SENTSTALL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="INCOMPTX" edc:desc="" edc:mask="0x1" edc:name="INCOMPTX" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="ISO" edc:desc="" edc:mask="0x1" edc:name="ISO" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E3114" edc:_begin="0x108" edc:_end="0x180" edc:_modsrc="DOS-EIP-00124_usb_hs_otgcore_v1.Module" edc:_refcount="6" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="USBE1CSR1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="USBE1CSR1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="USB">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXMAXP" edc:desc="" edc:mask="0x7ff" edc:name="RXMAXP" edc:nzwidth="11"/>
            <edc:SFRFieldDef edc:cname="MULT" edc:desc="" edc:mask="0x1f" edc:name="MULT" edc:nzwidth="5"/>
            <edc:SFRFieldDef edc:cname="RXPKTRDY" edc:desc="" edc:mask="0x1" edc:name="RXPKTRDY" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FIFOFULL" edc:desc="" edc:mask="0x1" edc:name="FIFOFULL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ERROR" edc:desc="" edc:mask="0x1" edc:name="ERROR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DERRNAKT" edc:desc="" edc:mask="0x1" edc:name="DERRNAKT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FLUSH" edc:desc="" edc:mask="0x1" edc:name="FLUSH" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="REQPKT" edc:desc="" edc:mask="0x1" edc:name="REQPKT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RXSTALL" edc:desc="" edc:mask="0x1" edc:name="RXSTALL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CLRDT" edc:desc="" edc:mask="0x1" edc:name="CLRDT" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INCOMPRX" edc:desc="" edc:mask="0x1" edc:name="INCOMPRX" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DATATGGL" edc:desc="" edc:mask="0x1" edc:name="DATATGGL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DATATWEN" edc:desc="" edc:mask="0x1" edc:name="DATATWEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAREQMD" edc:desc="" edc:mask="0x1" edc:name="DMAREQMD" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PIDERR" edc:desc="" edc:mask="0x1" edc:name="PIDERR" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMAREQEN" edc:desc="" edc:mask="0x1" edc:name="DMAREQEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AUTORQ" edc:desc="" edc:mask="0x1" edc:name="AUTORQ" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AUTOCLR" edc:desc="" edc:mask="0x1" edc:name="AUTOCLR" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="18"/>
            <edc:SFRFieldDef edc:cname="UNDERRUN" edc:desc="" edc:mask="0x1" edc:name="UNDERRUN" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SENDSTALL" edc:desc="" edc:mask="0x1" edc:name="SENDSTALL" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SENTSTALL" edc:desc="" edc:mask="0x1" edc:name="SENTSTALL" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="INCOMPTX" edc:desc="" edc:mask="0x1" edc:name="INCOMPTX" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="ISO" edc:desc="" edc:mask="0x1" edc:name="ISO" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
